# Завдання:
#    * згенерувати лист з рандомними числами (числа від 50 до 100 кожне,
#      довжину листа запитати у користувача, але не коротший за 10 та не
#      довший за 50 елементів;
#    * порахувати кількість елементів списку які більше обох своїх сусідніх
#      (зліва та справа)
#
# Підказки:
#    * перший та останній елементи не мають достатьно сусідніх, тому повинні бути виключені

import random


def generate_list(size):
    """Функція повертає список рандомних чисел від 50 до 100"""
    l = []
    for _ in range(0, size):
        l.append(50 + (round(random.random() * 100) % 50))
    return l


def calculation_func(l):
    """Функція підрахунку кількості елементів в списку які больше обох своїх сусідніх"""
    amount = 0
    print(l)
    for i in range(1, len(l) - 1):
        if l[i - 1] < l[i] > l[i + 1]:
            amount += 1
    print(f"Кількість елементів списку які більше обох своїх сусідніх = {amount}")


def main():
    """Головна функція, яка зв'язала у собі всі попередні. Додана можливість
     циклічного вводу"""
    while True:
        size = int(input("Введите длину массива (от 10 до 50): "))
        if size < 10 or size > 50:
            continue
        l = generate_list(size)
        calculation_func(l)


if __name__ == '__main__':
    main()
