# Згенерувати, за допомогою list comprehension, послідовність
# цілих чисел 0..N де будуть відсутні кожний  K-ий елемент
#
# N, K запитати у користувача
# K повинно бути менша за N (строго), дозволити ввод К більшого
# за N але відмасштабувати його до розмірів менших за N (%)
#
n = int(input("Введіть розміри масива: "))
k = int(input("Введіть номер елементів які будуть відсутні: "))
k %= n
l = [i for i in range(n) if i == 0 or (i+1) % k != 0]
print(f"Список в якого вісутній кожен {k} елемент: {l}")
