# Завдання: порахуйте кількість літер у строкі. Строка та літера 
#           даються на вхід користувачем. В залежності від кількости
#           виведіть на екран поясненя: строка містить літеру "с" до 
#           10 разів, строка містить літеру "с" до 20 разid, строка містить
#           символ "c" більше 20 разів. Проінформуйте користувача якщо
#           введено більше ніж одну літеру або повідомляти якщо такої літери
#           взагалі не знайдено. Програма повинна використовувати
#           інструкцію цикла для ітерації літер строки (не через метод str).
#           Програма повинна дозволяти користувачу вводити данні до 10 разів
#           (як попередня програма але лімітувати кількість можливостей).
#
# Приклад:
#
# Введіть текст: Це якийсь рандомний текст
# Введіть літеру: й
# Строка містить літеру "й" до 10 разів.
#
# Введіть текст: аааааааааааааааааааааааа
# Введіть літеру: а
# Строка містить літеру "а" більше 20 разів.

# str_1 = input()
# number = input()
#
def input_data():
    """Функція для вводу даних"""
    text = input("Введіть строку: ")
    letter = input("Введіть літеру кількість якої будемо підраховувати: ")
    return text, letter


def calculation_sum(text, letter):
    """Функція яка обчислює кількість введеної літери в реченні"""
    sum = 0
    for i in text:
        if i == letter:
            sum += 1
    return sum


def main():
    """Функція зв'язує функцію ввода даних та обчислення кількості обранної літери в реченні, додається цикл
    та перевірка введенних даних"""
    i = 0
    while i < 10:
        text, letter = input_data()
        if len(letter) == 1 and len(text) > 0:
            sum = calculation_sum(text, letter)
            print_data(letter, sum)
        else:
            print("Невірний ввод")
        i += 1


def print_data(letter, sum):
    """Функція  виводу даних"""
    if 0 < sum < 10:
        amount = "до 10"
    elif 10 < sum < 20:
        amount = "більше 10"
    elif sum > 20:
        amount = "більше 20"
    else:
        amount = "0"
    print(f"Строка містить символ  {letter}  {amount} разів")


if __name__ == '__main__':
    main()
