"""Задача: написати функцію пошуку елемента у послідовності.

   Деталі:
            * функція приймає два аргумента - послідовність та елемен
            * функція повинна повернути індекс елемента у послідовності
              або -1 якщо не знайдено
            * це аналог функції str.find, list.index
            * написати якийсь код який надає пару прикладів використування

    Приклад:
            * search_linearly([1, 8, 7, 33, 9, 2], 8) -> повертає 1
            * search_linearly("hello world!", "!") -> повертає 11
            * search_linearly(tuple(range(10)), 10) -> повертає -1
"""


def input_data(choose):
    """Функція введення даних"""
    l = ""
    if choose == '1':
        l = input("Введіть послідовність: ").split()
    if choose == '2':
        l = input("Введіть послідовність: ")
    el = input("Элемент: ")
    return l, el


def search_elem(l, el):
    """Функція пошуку позиції елемента у послідовності"""
    k = 0
    if el not in l:
        print(-1)
    else:
        for i in l:
            if i == el:
                print(f"Елемент {el} : позиція {k}")
            k += 1
    return k


def main():
    """Головна функція, дозволяє вибір пошуку елемента по листу або реченню необмеженну кількість разів"""
    while True:
        choose = input("1 - пошук елементів в листі, 2 - пошук елементів в строке: ")
        if choose == "":
            continue
        l, el = input_data(choose)
        k = search_elem(l, el)


if __name__ == '__main__':
    main()
