#  Згенерувати послідовність ряду Fibonacci до N-го елементу
#
#  Ряд Фібоначчі - числова послідовність - де кожний елемент -
#  сумма двух попередніх
#
#  N = 7
#  0 1 1 2 3 5 8
#
#  0 1 1 початкові елементи
#  0 1 N-2+N-1
#
#  Приклади:
#            fib(0) -> 0
#            fib(1) -> 1
#            fib(7) -> 8
#            fib(9) -> 13

# n = int(input("n: "))
# l = [0, 1]
# el = 0
# i = 0
# while i < (n-2):
#     el = l[i] + l[i+1]
#     l.append(el)
#     i += 1
# print(l)


def input_data():
    """Функція для вводу даних"""
    n = int(input("n: "))
    return n


def fib(n):
    """Функція яка повертає число Фінабоччі"""
    if n < 3:
        return 1
    return fib(n - 2) + fib(n - 1)


def main():
    """Головна функція для з'єднує ввод даних та обчислення числа Фінабоччі"""
    n = input_data()
    n_fib = fib(n-2)
    print(n_fib)


if __name__ == '__main__':
    main()
