# Завдання: запитати у користувача послідовність чисел та вивести
#           лише більші 10-и. Уточнення - для конвертації строки вводу
#           використати map з функцією int (числа цілі) а для фільтрації
#           filter з lambda
#
# Приклад:
#         ввод: 32 7 0 10 11 78 9 5 23 99
#         вивод: 32 11 78 23 99
#
# Підказки:
#           str.split, ''.join(sequence)
#           list(map), list(filter)
l = input("Введіть послідовність: ").split()
l2 = list(filter(lambda x: x > 10, list(map(int, l))))
print(l2)
